var songs =[
    {
        "lines": "一年前的除夕，我对小宝表白了…"
    },
    {
        "lines": "现在又是除夕，小宝是我女朋友。"
    },
    {
        "lines": ""
    },
    {
        "lines": "这里记录了遇见小宝的故事、喜欢上小宝的故事"
    },
    {
        "lines": ""
    },
    {
        "lines": "那是一个买包子的早上"
    },
    {
        "lines": "我看到小宝进了便利店"
    },
    {
        "lines": "每每回忆初次见到她，都感觉那是惊鸿一瞥"
    },
    {
        "lines": "这女孩子也太可爱了吧！"
    },
    {
        "lines": "如果那天晚上我会看到一颗流星"
    },
    {
        "lines": "如果让我说出最想要的礼物"
    },
    {
        "lines": "那便是"
    },
    {
        "lines": "给我个机会认识她"
    },
    {
        "lines": "我是个不擅长跟女孩子交流的人"
    },
    {
        "lines": "但是我要告诉自己：鼓起勇气吧"
    },
    {
        "lines": "在一个平平淡淡的工作日"
    },
    {
        "lines": "我踏上了往返无数次熟悉的线路，熟悉的地铁"
    },
    {
        "lines": "但是，我怀揣着不熟悉的心情"
    },
    {
        "lines": "我第一眼就看到了肯定是她的那个微信头像"
    },
    {
        "lines": "“加油”"
    },
    {
        "lines": "我告诉自己。"
    },
    {
        "lines": "“红衣服黄衣服粉衣服，是你吗？”"
    },
    {
        "lines": "“你说的是🌈吧”"
    },
    {
        "lines": "从这一天开始，未来的日子好像不再平淡了"
    },
    {
        "lines": ""
    },
    {
        "lines": "有一个叫冯议萱的人，慢慢霸占了我的脑袋瓜"
    },
    {
        "lines": "吃饭是她"
    },
    {
        "lines": "走路是她"
    },
    {
        "lines": "睡觉是她"
    },
    {
        "lines": "敲代码也是她"
    },
    {
        "lines": "这可怎么办呀？"
    },
    {
        "lines": "我好像是真的喜欢她"
    },
    {
        "lines": "我决定要认真喜欢她！"
    },
    {
        "lines": "可是我不太会追女孩子，怎么办？"
    },
    {
        "lines": "这可把我这个直男给难倒了"
    },
    {
        "lines": "我搜了下知乎"
    },
    {
        "lines": "我又搜了下小红书"
    },
    {
        "lines": "尽是些超出我知识范围的东西"
    },
    {
        "lines": "一看，就不靠谱"
    },
    {
        "lines": "我还是好好跟她聊天吧"
    },
    {
        "lines": "我还是慢慢去了解她吧"
    },
    {
        "lines": "我怕吓到她"
    },
    {
        "lines": "我每天就是这么跟她说话啊，说话啊，就像是网友"
    },
    {
        "lines": "在一个阳光很好的周末，我画了一幅画给她"
    },
    {
        "lines": "是她的头像"
    },
    {
        "lines": "“想要吗？”"
    },
    {
        "lines": "“哇，真的吗？想！”"
    },
    {
        "lines": "我有机会不做她的网友了"
    },
    {
        "lines": ""
    },
    {
        "lines": "后来，我去西安出差了"
    },
    {
        "lines": "西安对我的印象，你猜是什么？"
    },
    {
        "lines": "是《园游会》"
    },
    {
        "lines": "这是小宝点的第一首歌"
    },
    {
        "lines": "我觉得好难，所以我听了好多遍"
    },
    {
        "lines": "是那种，在酒店洗澡听，在园区敲代码听，在出租车上听"
    },
    {
        "lines": "真的好难这首歌！"
    },
    {
        "lines": "我录下来了，虽然效果也不太好吧…"
    },
    {
        "lines": "但是她好像还挺喜欢的"
    },
    {
        "lines": "真好"
    },
    {
        "lines": "我开始经常跟她语音"
    },
    {
        "lines": "经常连线一起看电视"
    },
    {
        "lines": "开始经常说月亮"
    },
    {
        "lines": "经常说午安"
    },
    {
        "lines": "经常…"
    },
    {
        "lines": "经常幻想她是我女朋友"
    },
    {
        "lines": "西安对很多人来说"
    },
    {
        "lines": "可能是大唐不夜城"
    },
    {
        "lines": "可能是肉夹馍和凉皮"
    },
    {
        "lines": "可能是乡愁"
    },
    {
        "lines": "但对于我来说"
    },
    {
        "lines": "那是一座装满了对小宝的思念的城市"
    },
    {
        "lines": "思念真的难以按捺得住"
    },
    {
        "lines": "我的心早已经飞回了广州"
    },
    {
        "lines": ""
    },
    {
        "lines": "有没有约女孩子爬山的？"
    },
    {
        "lines": "有，就是我"
    },
    {
        "lines": "看电影吧？就只是看电影了"
    },
    {
        "lines": "逛街吧？我们其实不是很熟，不能放开了逛"
    },
    {
        "lines": "爬山也许可以看看风景，聊聊天？"
    },
    {
        "lines": "我真棒"
    },
    {
        "lines": "我把她约出来了"
    },
    {
        "lines": "虽然她其实不怎么想出门吧，但，没关系"
    },
    {
        "lines": "那天我们很晚才下山"
    },
    {
        "lines": "她请我吃了一碗粉"
    },
    {
        "lines": "我们不用微信聊了很久的天"
    },
    {
        "lines": "我发现她是一个从外表到内心都很可爱的女孩子"
    },
    {
        "lines": "嗯…"
    },
    {
        "lines": "就像吃了一天的糖果"
    },
    {
        "lines": "我的心情好甜"
    },
    {
        "lines": "回家的时候"
    },
    {
        "lines": "真的恋恋不舍"
    },
    {
        "lines": "想多跟她待一会"
    },
    {
        "lines": "如果可以的话"
    },
    {
        "lines": "这一天一直不要过去多好"
    },
    {
        "lines": ""
    },
    {
        "lines": "我们相识的过程也许很简单"
    },
    {
        "lines": "也许没有很戏剧性"
    },
    {
        "lines": "但是"
    },
    {
        "lines": "她的出现，是我遇到最惊艳的事"
    },
    {
        "lines": "我对她的喜欢"
    },
    {
        "lines": "可以是很久很久"
    },
    {
        "lines": "就像这里的999个字符"
    },
    {
        "lines": "是我想要很久很久的愿望"
    }
];
var colors = [
  "#7ECDB6",
  "#EB7FAF",
  "#986C85",
  "#CE3B3B",
  "#597E82",
  "#015F5A"
]
$(document).ready(function(){
  var index = 0;
  $("#next").on("click",function(){
    var html_lines = "";
    var html_by = "- ";
    index = index + 1;
    var one = songs[index];
    html_lines += one.lines;
    html_by += one.singer;
    $("#text #lines").html(html_lines);
    $("#by").html(html_by);
    
    $("body, .btn").css("background",colors[index]);
    $("#text, #by").css("color",colors[index]);
  });
});